Autodesk.Revit.DB.Structure.RebarConstraintsManager.ApplyRebarConstraints(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.RebarConstraint},System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Returns true if constraints were applied to rebar with success.
Remarks:
ShapeDriven : The input constraints belong to other rebar in a (different) similar host. Only constraints of type ToHostFace or ToCover are considered.
The method modifies the constraints' target references with their correspondants in current host(s).
The modified constraints are set in current rebar.
The method will fail : if there exists at least one ToOtherRebar constraint; if corresponding target references in current host(s) are not supplied or found.
FreeForm : The constraints will not be applied and the method will return false.
The two arrays go hand in hand : they must have the same size; the correspondant of oldReference at index x is found in the other array at the same index x.
constraintsToApply:
Represent the new constraints to be applied to rebar.
oldTargets:
Represent the old target references.
newTargets:
Represent the new target references.
Returns:
Returns true if the constraints were applied succesfully, false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2019

Autodesk.Revit.DB.Structure.RebarConstraintsManager.AllowConstraintTargets(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Returns true if references are valid targets for handle, false otherwise.
Remarks:
For a free form rebar valid targets are one or more references to faces of elements that can host rebar.
For a shape driven rebar this function will always return false. RebarConstraintsManager.GetConstraintCandidatesForHandle() can be used to obtain possible constraints.
handle:
Represents the constrainable rebar handle.
targetsToConstrain:
Represent the refernces to be checked as valid targets for handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraintsManager.ClearHandleConstraintPairHighlighting(Autodesk.Revit.DB.Document)
Clears all highlighting in all views.
Remarks:
If highlightHandleConstraintPairInAllViews has been called, then this method can
be used to remove all highlighting.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.HighlightHandleConstraintPairInAllViews(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.Structure.RebarConstraint)
Highlights the specified RebarConstrainedHandle and RebarConstraint in all views.
Remarks:
This method is provided as a way to help end users visualize more easily the effect
that selecting new RebarConstraints for the Rebar element's RebarConstrainedHandle
will have on the Rebar.  It is purely for graphical output, and does not assume any
relationship between the RebarConstrainedHandle and the RebarConstraint.  The caller
is responsible for updating (or clearing) the highlighting in response to changes
in the Rebar's constraints.
Repeated calls to this method are not cumulative; highlighting from previous calls
will be cleared before new highlighting is applied.
handle:
The RebarConstrainedHandle to be highlighted in all views.
constraint:
The RebarConstraint to be highlighted in all views.
Throws Autodesk.Revit.Exceptions.ArgumentException:
constraint is no longer valid.
-or-
handle is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.GetPreferredConstraintOnHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle)
For ShapeDriven: Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle.
For FreeForm:  Returns the RebarConstraint that acts on the specified RebarConstraintHandle.
handle:
The RebarConstrainedHandle for which the RebarConstraint is to be returned.
Returns:
The user preferred RebarConstraint applied to the RebarConstrainedHandle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.RemovePreferredConstraintFromHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle)
For ShapeDriven: Clears the user-preferred RebarConstraint from the specified RebarConstrainedHandle.
For FreeForm: Removes the RebarConstraint that is associated to the specified RebarConstrainedHandle.
Remarks:
ShapeDriven:
After the preferred constraint is removed, the rebar will search for an appropriate
default constraint for the handle in its current position.  In some cases, this will
cause the handle to snap a small distance to a new target.  However, in many situations,
the handle will simply remain in its current position, and either continue to use the
same constraint target (while no longer treating that target as preferred), or acquire
a FixedDistancetoHostFace constraint to the nearest host element surface.
The handle will not, in general, be restored to the position it originally occupied
before the preferred constraint was applied.
FreeForm:
After the Constraint is removed, the handle remains unconstrained, and the shape calculation
tries to resolve a shape without this information. Depending on the calculation method,
the bar may not have all the necessary information, so the responsibility to constrain
this handle is in the hands of the caller of this function.
handle:
The RebarConstrainedHandle for which the user RebarConstraint is to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.SetPreferredConstraintForHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.Structure.RebarConstraint)
For ShapeDriven Rebar: Sets the RebarConstraint as preferred constraint target for the specified RebarConstrainedHandle.
For FreeForm Rebar: Sets the RebarConstraint as the target for the specified RebarConstraintHandle.
Remarks:
ShapeDriven:
The RebarConstraint should be one of the candidate RebarConstraints returned by
getConstraintCandidatesForHandle.
In general, the caller should assume that the 'set' operation can fail, as some
of the candidates may be legal targets for the handle, but may cause the rebar
to flex into an insoluble shape.
Once a preferred constraint has been successfully assigned to a handle, the
user can still drag the handle, and the Rebar can generally be flexed in much
the same way as it could before (preferred constraints do not have the same
effect as Revit locked dimensions).  However, the rebar's behavior will change
in subtle ways.
A handle with a FixedDistanceToHostFace preferred constraint will allow the
constraint's offset distance to change as the user moves the handle.  However,
in subsequent model updates, the handle will continue to follow the preferred
constraint target, even if other legitimate constraint targets are closer to
the handle.  One can think of this behavior as equivalent to unlocking a
locked dimension, moving one of dimension references, and then re-locking the
dimension - all in one step.
When a handle with a ToCover or ToOtherRebar preferred constraint is dragged by
the user, it will snap back to its constraint target, unless it is dragged
beyond tolerance distance.  In that case, it will select a new constraint using
default logic, but will continue to treat the "broken" constraint as preferred,
and will snap back to the preferred target again, if it is dragged to within
tolerance distance.
If, during a model update, the rebar determines that a preferred constraint
target no longer exists, or has been modified so that it is no longer a legal
candidate for the handle, then the rebar will remove the preferred status of
that target and will assign a new constraint to the handle using the default
logic.
FreeForm:
Sets the RebarConstraint to be active for the specified RebarConstrainedHandle.
The RebarConstrainedHandle needs to be a valid handle for this rebar element.
handle:
The RebarConstrainedHandle to which the new RebarConstraint is to be applied.
constraint:
The new RebarConstraint to be applied to the RebarConstrainedHandle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
constraint is no longer valid.
-or-
handle is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.GetConstraintCandidatesForHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.Reference)
For shape driven rebar returns all possible RebarConstraints that will constrain RebarConstrainedHandle to the provided reference.
For free form rebar will return an empty lists.
Remarks:
Will throw exception if the provided reference cannot be used to constrain the provided rebar handle.
handle:
The RebarConstrainedHandle for which constraint candidates are sought.
reference:
The reference you want to constrain to.
Returns:
A collection of RebarConstraints
Throws Autodesk.Revit.Exceptions.ArgumentException:
reference is not from a valid RebarConstraint target element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraintsManager.GetConstraintCandidatesForHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.ElementId)
For shape driven rebar returns all possible RebarConstraints belonging to references from the provided element that could be used for a specified RebarConstrainedHandle.
For free form rebar will return an empty list.
Remarks:
Will throw exception if the provided elementId is not a valid constraint target.
handle:
The RebarConstrainedHandle for which constraint candidates are sought.
elementId:
The elementId ( host or rebar ) of the element in which the candidates are searched for.
Returns:
A collection of RebarConstraints
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId is not a valid RebarConstraint target element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraintsManager.GetConstraintCandidatesForHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle)
For shape driven rebar returns all possible RebarConstraints that could be used for a specified RebarConstrainedHandle.
For free form rebar will return an empty list.
handle:
The RebarConstrainedHandle for which constraint candidates are sought.
Returns:
A collection of RebarConstraints
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.GetCurrentConstraintOnHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle)
Retrieves the RebarConstraint that acts on the specified RebarConstraintHandle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2014